feat: Add docker for local running, update NAV bar to match portfolio, clean up portfolio side
